#ifndef __CRCPR32_H__
#define __CRCPR32_H__

#include "urc.h"

/******    CRC32    ******/
/*===========================================================================*/

/** 
*  @brief  »нициализаци€ данных дл€ расчета crc32.
*/
void Crc32_InitCrc(void);

/**
    @brief CRC32 рассчитываетс€ на фиксированном палиндроме 0x04C11DB7
           Ќачальное значение 0xFFFFFFFF.
           ‘ункци€ добавл€ет блок данных к расчитываемой контрольной сумме.
    @param buf - указатель на блок данных, который нужно добавить к
                 расчитываемой контрольной сумме.
           len - длина блока данных.
    @return - crc32
*/
UINT32 Crc32_AddBlockCrc(UINT8 *buf, UINT32 len);

#endif

